Revit 2026 API

# SunAndShadowSettingsFitToModel Method

---

Adjust SunAndShadowSettings to fit around the current model geometry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void FitToModel()
```
```vb
Public Sub FitToModel
```
```cpp
public:
void FitToModel()
```
```fsharp
member FitToModel : unit -> unit
```

| Exception | Condition |
| --- | --- |
| ArgumentException | The SunAndShadowSettings is not view-specific. |

#### Reference

SunAndShadowSettings Class

Autodesk.Revit.DB Namespace